mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*	header info, to be added
 *
 *
 *
 */


/*******************************************************************************
 *                              INCLUDE FILES
 ******************************************************************************/
#include <stddef.h>
#include <string.h>

#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "cfg_nrf_drv_spi.h"
#include "cfg_nrf51_muha_pinout.h"
#include "bsp_ecg_ADS1192.h"

/*******************************************************************************
 *                              DEFINES
 ******************************************************************************/
//! ADC constants
#define BSP_ECG_ADS1192_ADC_REF_VOLTAGE         (2.42f) //!< ADC reference voltage
#define BSP_ECG_ADS1192_ADC_MAX_VALUE           (32767) //!< Maximal ADC value (2^15 - 1)

//! ECG ADS1192 SPI commands
#define BSP_ECG_ADS1192_SPI_WAKEUP              (0x02u) //!< Wake-up from standby mode
#define BSP_ECG_ADS1192_SPI_STANDBY             (0x04u) //!< Enter standby mode
#define BSP_ECG_ADS1192_SPI_RESET               (0x06u) //!< Reset the device
#define BSP_ECG_ADS1192_SPI_START               (0x08u) //!< Start conversions
#define BSP_ECG_ADS1192_SPI_STOP                (0x0Au) //!< Stop conversion
#define BSP_ECG_ADS1192_SPI_OFFSETCAL           (0x1Au) //!< Channel offset calibration
#define BSP_ECG_ADS1192_SPI_RDATAC              (0x10u) //!< Read Data Continuous mode
#define BSP_ECG_ADS1192_SPI_SDATAC              (0x11u) //!< Stop Read Data Continuous
#define BSP_ECG_ADS1192_SPI_RDATA               (0x12u) //!< Read data by command

//! ECG ADS1192 SPI constants
#define BSP_ECG_ADS1192_SPI_READ_CMD            (0x20u) //!< SPI read command
#define BSP_ECG_ADS1192_SPI_WRITE_CMD           (0x40u) //!< SPI write command
#define BSP_ECG_ADS1192_SPI_SIZE_READ           (2u)    //!< SPI Read command size (bytes)
#define BSP_ECG_ADS1192_SPI_SIZE_WRITE          (3u)    //!< SPI Write command size (bytes)
#define BSP_ECG_ADS1192_SPI_SIZE_SINGLE_BYTE    (1u)    //!< Single SPI byte size
#define BSP_ECG_ADS1192_SPI_SIZE_SINGLE_FRAME   (6u)    //!< Single SPI read - consists of 6 bytes
#define BSP_ECG_ADS1192_SPI_MSG_MAX_SIZE        (14u)   //!< Maximum SPI message size
#define BSP_ECG_ADS1192_SPI_SINGLE_REG          (0x00u) //!< Single register read operation
#define BSP_ECG_ADS1192_SPI_READ_OFFSET         (1u)    //!< SPI read RX offset
#define BSP_ECG_ADS1192_SPI_REG_VALUE_INDEX     (2u)    //!< SPI register value index


//! ECG ADS1192 Time constants
#define BSP_ECG_ADS1192_WAIT_TIME_8_US          (8u)    //!< 8 us wait time
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_4_TCLK   (8u)    //!< 4 tCLK time period (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_18_TCLK  (36u)   //!< 18 tCLK time period (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_1_FMOD   (8u)    //!< 1 fMOD wait time (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_9_FMOD   (72u)   //!< 9 fMOD wait time (us)
#define BSP_ECG_ADS1192_INIT_OSC_WAIT_TIME_US   (32u)   //!< Internal oscillator wait time (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_1_MS     (1000u) //!< 1ms wait time
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS   (200000u) //!< 200ms wait time
#define BSP_ECG_ADS1192_WAIT_TIME_OFFSETCAL_MS  (310u)  //! Offset calibration wait time (ms)

//! ECG ADS1192 bit manipulation constants
#define BSP_ECG_ADS1192_LEAD_OFF_MASK           (0x0Fu) //!< Channel 1 and 2 Lead-off detection
#define BSP_ECG_ADS1192_BYTE_SHIFT              (8u)    //!< Byte shift value

//! ECG ADS1192 temperature constants
#define BSP_ECG_ADS1192_TEMP_CONST_1            (168)   //!< Temperature constant 1
#define BSP_ECG_ADS1192_TEMP_CONST_2            (394)   //!< Temperature constant 2
#define BSP_ECG_ADS1192_TEMP_CONST_3            (25)    //!< Temperature constant 3
#define BSP_ECG_ADS1192_TEMP_BIT_MASK           (8u)    //!< Temperature bit mask

//! ECG ADS1192 register values
#define BSP_ECG_ADS1192_LEAD_OFF_BOTH_CHANNELS  (0x0Fu) //!< Register value for lead-off detection
#define BSP_ECG_ADS1192_LEAD_OFF_THRESHOLD      (0x1Cu) //!< Threshold value for lead-off detection
#define BSP_ECG_ADS1192_RLD_OFF_BOTH_CHANNELS   (0x1Fu) //!< Register value for RLD-off detection
#define BSP_ECG_ADS1192_LEAD_OFF_COMP_ENABLE    (1u)    //!< Enable lead-off comparator
#define BSP_ECG_ADS1192_LEAD_OFF_COMP_DISABLE   (0u)    //!< Disable lead-off comparator
#define BSP_ECG_ADS1192_INT_REF_BUFF_ENABLE     (1u)    //!< Enable internal reference buffer
#define BSP_ECG_ADS1192_INT_REF_BUFF_DISABLE    (0u)    //!< Disable internal reference buffer
#define BSP_ECG_ADS1192_TEST_SIGNAL_ENABLE      (1u)    //!< Enable test signal
#define BSP_ECG_ADS1192_TEST_SIGNAL_DISABLE     (0u)    //!< Disable test signal
#define BSP_ECG_ADS1192_TEST_SIGNAL_DC          (0u)    //!< Set test signal to DC
#define BSP_ECG_ADS1192_TEST_SIGNAL_1HZ         (1u)    //!< Set test signal to 1Hz

//! ECG ADS1192 register addresses
#define BSP_ECG_ADS1192_REG_ADDR_ID             (0x0u)  //!< ID Control register
// global settings across channels
#define BSP_ECG_ADS1192_REG_ADDR_CONFIG_1       (0x1u)  //!< Configuration register 1
#define BSP_ECG_ADS1192_REG_ADDR_CONFIG_2       (0x2u)  //!< Configuration register 2
#define BSP_ECG_ADS1192_REG_ADDR_LOFF           (0x3u)  //!< Lead-off Control register
// channel specific settings
#define BSP_ECG_ADS1192_REG_ADDR_CH1_SET        (0x4u)  //!< Channel 1 settings
#define BSP_ECG_ADS1192_REG_ADDR_CH2_SET        (0x5u)  //!< Channel 2 settings
#define BSP_ECG_ADS1192_REG_ADDR_RLD_SENS       (0x6u)  //!< RLD Sense selection
#define BSP_ECG_ADS1192_REG_ADDR_LOFF_SENS      (0x7u)  //!< Lead-off Sense selection
#define BSP_ECG_ADS1192_REG_ADDR_LOFF_STAT      (0x8u)  //!< Lead-off Status
// GPIO and other settings
#define BSP_ECG_ADS1192_REG_ADDR_MISC_1         (0x9u)  //!< Miscellaneous Control register 1
#define BSP_ECG_ADS1192_REG_ADDR_MISC_2         (0xAu)  //!< Miscellaneous Control register 2
#define BSP_ECG_ADS1192_REG_ADDR_GPIO           (0xBu)  //!< General-Purpose IO register

