mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
        // check if any Lead is off
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_detectLeadOff(inDevice, &ecgErr);
        }

        // check if RLD is off
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_detectRldOff(inDevice, &ecgErr);
        }
#endif // #if (DEBUG == true)

        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            BSP_ECG_ADS1192_setNormalElectrodeRead(inDevice, &ecgErr);
        }

        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            inDevice->isInitialized = true;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Starts reading and outputting data received from channel inputs.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.12.2020
 ******************************************************************************/
void BSP_ECG_ADS1192_startEcgReading(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // issue read continuous command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // enable ECG_DRDY pin interrupt
        nrf_drv_gpiote_in_event_enable(ECG_DRDY, true);
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Stops reading and outputting data from channels and disables DRDY
 *        interrupt.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    18.12.2020
 ******************************************************************************/
void BSP_ECG_ADS1192_stopEcgReading(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // issue read continuous command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // disable ECG_DRDY pin interrupt
        nrf_drv_gpiote_in_event_disable(ECG_DRDY);
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 *                         PRIVATE FUNCTION DEFINITIONS
 ******************************************************************************/
/*******************************************************************************
 * @brief Function for converting output signal into usable value.
 * @details Converts 8-bit output signal array into correct 16-bit
 *          twos-complement values (amplitudes).
 ******************************************************************************
 * @param [in]  *inData    - pointer to input data array.
 * @param [in]  inDataSize - input data array size.
 * @param [out] *outData   - pointer to output data array.
 ******************************************************************************
 * @author  mario.kodba
 * @date    05.12.2020
 ******************************************************************************/
static inline void BSP_ECG_ADS1192_convertSignalToSignedVal(const uint8_t *inData,
        const uint16_t inDataSize,
        int16_t *outData) {

    /* iterate over array of bytes and transfrom it into proper 16-bit value (digital code)
     * optionally, transform it into voltage amplitude */
    for(uint16_t i = 0, j = 0; i < inDataSize - 1; i += 2, j++) {
        int16_t tmp = *(inData + i + 1) | (*(inData + i) << BSP_ECG_ADS1192_BYTE_SHIFT);
        SEGGER_RTT_printf(0, "%d\n", tmp);
        memcpy((outData + j), &tmp, sizeof(int16_t));
    }
}

/*******************************************************************************
 * @brief Function sends predefined SPI command to the device.
 ******************************************************************************
 * @param [in]  *inDevice - pointer to device structure for ECG driver.
 * @param [in]  inSpiCmd  - SPI command.
 * @param [out] *outErr   - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    24.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_sendSpiCommand(BSP_ECG_ADS1192_device_S *inDevice,
        const uint8_t inSpiCmd,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    bool status = false;

    if(inDevice == NULL) {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    } else {
        status = DRV_SPI_masterTxBlocking(inDevice->config->spiInstance,
                         BSP_ECG_ADS1192_SPI_SIZE_SINGLE_BYTE,
                         &inSpiCmd);
        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(status != true) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for writing to single register of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  inReg        - register address.
 * @param [in]  *inData      - pointer to data to be sent.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_writeSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
        const BSP_ECG_ADS1192_reg_E inReg,
        const uint8_t *inData,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t opcode[BSP_ECG_ADS1192_SPI_SIZE_WRITE] = { 0u };
    uint8_t regAddr = ecgADS1192RegAddr[inReg];
    uint8_t txBufferLen = BSP_ECG_ADS1192_SPI_SIZE_WRITE;
    bool status = false;

    if((inDevice != NULL) && (inData != NULL)) {
        /* byte format for Read opcode: | 001R RRRR | 000N NNNN | DATA |
         * RRRR - regAddr, NNNN - number of registers to write to */
        opcode[0] = BSP_ECG_ADS1192_SPI_WRITE_CMD | regAddr;
        opcode[1] = BSP_ECG_ADS1192_SPI_SINGLE_REG;
        opcode[2] = *inData;

        status = DRV_SPI_masterTxBlocking(inDevice->config->spiInstance,
                         txBufferLen,
                         &opcode[0]);
        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(status != true) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

