mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Function for reading from single register of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  inReg        - register address to read from.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static uint8_t BSP_ECG_ADS1192_readSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
        const BSP_ECG_ADS1192_reg_E inReg,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t opcode[BSP_ECG_ADS1192_SPI_SIZE_READ] = { 0u };
    uint8_t outData[BSP_ECG_ADS1192_SPI_SIZE_READ + BSP_ECG_ADS1192_SPI_READ_OFFSET];
    uint8_t rxTxBufferSize = BSP_ECG_ADS1192_SPI_SIZE_READ + BSP_ECG_ADS1192_SPI_READ_OFFSET;
    uint8_t regAddr = ecgADS1192RegAddr[inReg];
    uint8_t retVal = 0xFFu;
    bool status = false;

    if(inDevice != NULL) {
        /* byte format for Read opcode: | 001R RRRR | 000N NNNN |
         * RRRR - regAddr, NNNN - number of registers to read */
        opcode[0] = BSP_ECG_ADS1192_SPI_READ_CMD | regAddr;
        opcode[1] = BSP_ECG_ADS1192_SPI_SINGLE_REG;

        // start SPI transfer
        status = DRV_SPI_MasterTxRxBlocking(inDevice->config->spiInstance,
                         &opcode[0],
                         rxTxBufferSize,
                         &outData[0]);
        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(status != true) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        } else {
            // return register value
            retVal = outData[BSP_ECG_ADS1192_SPI_REG_VALUE_INDEX];
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }

    return retVal;

}

/*******************************************************************************
 * @brief Function enables PGA calibration for ADS1192.
 * @details If offset calibration enabled and OFFSETCAL SPI command is sent,
 *          it takes at least 305ms for device to calibrate properly.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    12.12.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_enablePgaCalibration(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    uint8_t calib = 0x80u;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
            BSP_ECG_ADS1192_reg_MISC_2,
            (uint8_t *) &calib,
            &ecgErr);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function sets conversion (SPS) rate for ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [in]  inSps        - wanted conversion rate (SPS) for device.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    12.12.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_setConversionRate(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_convRate_E inSps,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    BSP_ECG_ADS1192_config1Reg_U conf1Reg = { .R = 0u };
    conf1Reg.B.dr = (uint8_t) inSps;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
            BSP_ECG_ADS1192_reg_CONFIG_1,
            (uint8_t *) &conf1Reg,
            &ecgErr);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Registers setup for normal electrode input.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.12.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_setNormalElectrodeRead(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };

    // set CONFIG 2 register for normal signal
    conf2Reg.B.pdbRefBuf = BSP_ECG_ADS1192_INT_REF_BUFF_ENABLE;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
            BSP_ECG_ADS1192_reg_CONFIG_2,
            (uint8_t *) &conf2Reg,
            &ecgErr);
    //TODO: [mario.kodba 05-12-2020] check if this is needed
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    // PGA setting defined in device configuration
    chReg.B.pga = (uint8_t) inDevice->config->pgaSetting;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH1_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH2_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);
    nrf_delay_ms(BSP_ECG_ADS1192_WAIT_TIME_OFFSETCAL_MS);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

