mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Function configures registers to output test signal.
 * @details Sets output of both channels to signal with amplitude
 *          +-(VREFP - VREFN) / 2420. In this case, VREFP = 2.42V, VREFN = 0V.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readTestSignal(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set CONFIG 2 register for test signal
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbRefBuf = BSP_ECG_ADS1192_INT_REF_BUFF_ENABLE;
    conf2Reg.B.intTest = BSP_ECG_ADS1192_TEST_SIGNAL_ENABLE;
    conf2Reg.B.testFreq = BSP_ECG_ADS1192_TEST_SIGNAL_1HZ;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
            BSP_ECG_ADS1192_reg_CONFIG_2,
            (uint8_t *) &conf2Reg,
            &ecgErr);
    //TODO: [mario.kodba 05-12-2020] check if this is needed
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
    chReg.B.mux = (uint8_t) BSP_ECG_ADS1192_mux_TEST_SIGNAL;
    chReg.B.pga = (uint8_t) BSP_ECG_ADS1192_pga_6X;
    // set both channels to output test signal with PGA = 6x
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH1_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH2_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);
    nrf_delay_ms(BSP_ECG_ADS1192_WAIT_TIME_OFFSETCAL_MS);

    // issue read continuous command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);

    // TODO: [mario.kodba 19-12-2020] add timer to output signal for 10 seconds

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // enable ECG_DRDY pin interrupt
        nrf_drv_gpiote_in_event_enable(ECG_DRDY, true);
    }

    // if the timer timed out, stop signal test

    // disable ECG_DRDY pin interrupt
    nrf_drv_gpiote_in_event_disable(ECG_DRDY);

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue stop read data continuous command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);
        // wait 4 * tCLK after sending SDATAC command
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Sets configuration to output supply voltage values on output.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    03.12.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readSupplyMeasurement(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[BSP_ECG_ADS1192_SPI_SIZE_SINGLE_FRAME] = { 0 };
    int16_t supplyMeasurements[BSP_ECG_ADS1192_SPI_SIZE_SINGLE_FRAME/2] = { 0 };

    BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
    chReg.B.mux = BSP_ECG_ADS1192_mux_SUPPLY_MEAS;
    chReg.B.pga = BSP_ECG_ADS1192_pga_1X;
    // set both channels to output test signal with PGA = 1
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH1_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH2_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }

    // calibrate PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);
    }
    nrf_delay_ms(BSP_ECG_ADS1192_WAIT_TIME_OFFSETCAL_MS);

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue read continuous command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // read data shifted out from device
        // 16 status bits + 2 channels x 16 bits
        BSP_ECG_ADS1192_readData(inDevice,
                BSP_ECG_ADS1192_SPI_SIZE_SINGLE_FRAME,
                &outBuffer[0],
                &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // convert SPI data to proper format
        BSP_ECG_ADS1192_convertSignalToSignedVal(&outBuffer[0],
                BSP_ECG_ADS1192_SPI_SIZE_SINGLE_FRAME,
                &supplyMeasurements[0]);
    }

    // save device supply
    inDevice->analogVddSupply =
            ((float) supplyMeasurements[1] / BSP_ECG_ADS1192_ADC_MAX_VALUE ) * BSP_ECG_ADS1192_ADC_REF_VOLTAGE * 2u;

    inDevice->digitalVddSupply =
            ((float) supplyMeasurements[2] / BSP_ECG_ADS1192_ADC_MAX_VALUE ) * BSP_ECG_ADS1192_ADC_REF_VOLTAGE * 4u;

    // set channels back to default settings
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH2_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CH1_SET,
                (uint8_t *) &chReg,
                &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);
    nrf_delay_ms(BSP_ECG_ADS1192_WAIT_TIME_OFFSETCAL_MS);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

