mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Detects if any of the electrodes is disconnected.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    29.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_detectLeadOff(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t regVal;

    // set Lead-off comparator threshold
    uint8_t loffReg = BSP_ECG_ADS1192_LEAD_OFF_THRESHOLD;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
            BSP_ECG_ADS1192_reg_LOFF,
            &loffReg,
            &ecgErr);

    // configure Configuration 2 register for lead-off detection
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbLoffComp = BSP_ECG_ADS1192_LEAD_OFF_COMP_ENABLE;
    conf2Reg.B.pdbRefBuf = BSP_ECG_ADS1192_INT_REF_BUFF_ENABLE;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CONFIG_2,
                (uint8_t *) &conf2Reg,
                &ecgErr);
    }
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    // configure LOFF_SENS register - both channels P+ and N- for lead-off detection
    uint8_t loffSensReg = BSP_ECG_ADS1192_LEAD_OFF_BOTH_CHANNELS;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_LOFF_SENS,
                &loffSensReg,
                &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue read command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);
    }

    // read Lead-off Status register
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        regVal = BSP_ECG_ADS1192_readSingleReg(inDevice,
                         BSP_ECG_ADS1192_reg_LOFF_STAT,
                         &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // check if any LEAD_OFF bit is set
        if((regVal & BSP_ECG_ADS1192_LEAD_OFF_MASK) != false) {
            ecgErr = BSP_ECG_ADS1192_err_LEAD_OFF;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function detects if Right Leg Drive (RLD) electrode is disconnected.
 ******************************************************************************
 * @param [in]  *inDevice    - pointer to device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    03.12.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_detectRldOff(BSP_ECG_ADS1192_device_S *inDevice,
        BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set Lead-off comparator threshold
    uint8_t loffReg = BSP_ECG_ADS1192_LEAD_OFF_THRESHOLD;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
            BSP_ECG_ADS1192_reg_LOFF,
            &loffReg,
            &ecgErr);

    // configure Configuration 2 register for lead-off detection
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbLoffComp = BSP_ECG_ADS1192_LEAD_OFF_COMP_ENABLE;
    conf2Reg.B.pdbRefBuf = BSP_ECG_ADS1192_INT_REF_BUFF_ENABLE;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_CONFIG_2,
                (uint8_t *) &conf2Reg,
                &ecgErr);
    }
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    // configure RLD_SENS register - both channels P+ and N- for RLD-off detection
    uint8_t rldSensReg = BSP_ECG_ADS1192_RLD_OFF_BOTH_CHANNELS;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                BSP_ECG_ADS1192_reg_RLD_SENS,
                &rldSensReg,
                &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // issue read command
        BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);
    }

    // read Lead-off Status register
    uint8_t regVal;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        regVal = BSP_ECG_ADS1192_readSingleReg(inDevice,
                         BSP_ECG_ADS1192_reg_LOFF_STAT,
                         &ecgErr);
    }

    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        // check if any LEAD_OFF bit is set
        if((regVal & BSP_ECG_ADS1192_LEAD_OFF_MASK) != false) {
            ecgErr = BSP_ECG_ADS1192_err_RLD_OFF;
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

#endif // #if (DEBUG == true)

/*******************************************************************************
 *                          END OF FILE
 ******************************************************************************/
